dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_i2c.c
/*******************************************************************************
* File Name: cy_hal_i2c.c
*
* Description:
* Provides a high level interface for interacting with the Cypress I2C. This is
* a wrapper around the lower level PDL API.
* 
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include "cy_hal_i2c.h"
#include "cy_hal_hwmgr.h"
#include "cy_hal_gpio.h"
#include "cy_hal_interconnect.h"
#include "cy_scb_i2c.h"
#include "cy_hal_scb_common.h"

#define PENDING_NONE                    0
#define PENDING_RX                      1
#define PENDING_TX                      2
#define PENDING_TX_RX                   3

/* Default I2C configuration */
static const cy_stc_scb_i2c_config_t default_i2c_config = {
        .i2cMode                   = CY_SCB_I2C_MASTER,
        .useRxFifo                 = true,
        .useTxFifo                 = true,
        .slaveAddress              = 0,
        .slaveAddressMask          = 0,
        .acceptAddrInFifo          = false,
        .ackGeneralAddr            = false,
        .enableWakeFromSleep       = false
}; 

static cy_i2c_irq_event_t cy_convert_interrupt_cause(uint32_t pdl_cause);

static cy_i2c_t *cy_i2c_config_structs[CY_IP_MXSCB_INSTANCES];
static cy_i2c_irq_handler_t cy_i2c_user_callbacks[CY_IP_MXSCB_INSTANCES];
static void *cy_i2c_callback_args[CY_IP_MXSCB_INSTANCES];

static void cy_i2c_0_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_1_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_2_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_3_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_4_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_5_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_6_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_7_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_8_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_9_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_10_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_11_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_12_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_13_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_14_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_15_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_16_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_17_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_18_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_i2c_19_cb_wrapper(uint32_t event) __attribute__((unused));

static void cy_i2c_0_irq_handler(void) __attribute__((unused));
static void cy_i2c_1_irq_handler(void) __attribute__((unused));
static void cy_i2c_2_irq_handler(void) __attribute__((unused));
static void cy_i2c_3_irq_handler(void) __attribute__((unused));
static void cy_i2c_4_irq_handler(void) __attribute__((unused));
static void cy_i2c_5_irq_handler(void) __attribute__((unused));
static void cy_i2c_6_irq_handler(void) __attribute__((unused));
static void cy_i2c_7_irq_handler(void) __attribute__((unused));
static void cy_i2c_8_irq_handler(void) __attribute__((unused));
static void cy_i2c_9_irq_handler(void) __attribute__((unused));
static void cy_i2c_10_irq_handler(void) __attribute__((unused));
static void cy_i2c_11_irq_handler(void) __attribute__((unused));
static void cy_i2c_12_irq_handler(void) __attribute__((unused));
static void cy_i2c_13_irq_handler(void) __attribute__((unused));
static void cy_i2c_14_irq_handler(void) __attribute__((unused));
static void cy_i2c_15_irq_handler(void) __attribute__((unused));
static void cy_i2c_16_irq_handler(void) __attribute__((unused));
static void cy_i2c_17_irq_handler(void) __attribute__((unused));
static void cy_i2c_18_irq_handler(void) __attribute__((unused));
static void cy_i2c_19_irq_handler(void) __attribute__((unused));

static __INLINE  void cy_i2c_cb_wrapper_indexed(uint32_t event, uint8_t idx)
{
    cy_i2c_irq_event_t anded_events = (cy_i2c_irq_event_t)(cy_i2c_config_structs[idx]->irq_cause & (uint32_t)cy_convert_interrupt_cause(event));
    if (anded_events)
    {
        cy_i2c_user_callbacks[idx](cy_i2c_callback_args[idx], anded_events);
    }
}
static void cy_i2c_0_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 0);
}
static void cy_i2c_1_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 1);
}
static void cy_i2c_2_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 2);
}
static void cy_i2c_3_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 3);
}
static void cy_i2c_4_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 4);
}
static void cy_i2c_5_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 5);
}
static void cy_i2c_6_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 6);
}
static void cy_i2c_7_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 7);
}
static void cy_i2c_8_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 8);
}
static void cy_i2c_9_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 9);
}
static void cy_i2c_10_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 10);
}
static void cy_i2c_11_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 11);
}
static void cy_i2c_12_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 12);
}
static void cy_i2c_13_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 13);
}
static void cy_i2c_14_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 14);
}
static void cy_i2c_15_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 15);
}
static void cy_i2c_16_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 16);
}
static void cy_i2c_17_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 17);
}
static void cy_i2c_18_cb_wrapper(uint32_t event)
{
    cy_i2c_cb_wrapper_indexed(event, 18);
}
static void cy_i2c_19_cb_wrapper(uint32_t event) 
{
    cy_i2c_cb_wrapper_indexed(event, 19);
}

static void (*cy_i2c_cb_wrapper_table[CY_IP_MXSCB_INSTANCES])(uint32_t event) =
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cy_i2c_0_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cy_i2c_1_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cy_i2c_2_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cy_i2c_3_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cy_i2c_4_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cy_i2c_5_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cy_i2c_6_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cy_i2c_7_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cy_i2c_8_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cy_i2c_9_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cy_i2c_10_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cy_i2c_11_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cy_i2c_12_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cy_i2c_13_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cy_i2c_14_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cy_i2c_15_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cy_i2c_16_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cy_i2c_17_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cy_i2c_18_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cy_i2c_19_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

static void cy_i2c_interrupts_dispatcher_IRQHandler(uint32_t i2c_num)
{
    Cy_SCB_I2C_Interrupt(cy_i2c_config_structs[i2c_num]->base, &(cy_i2c_config_structs[i2c_num]->context));
}
static void cy_i2c_0_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(0);
}
static void cy_i2c_1_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(1);
}
static void cy_i2c_2_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(2);
}
static void cy_i2c_3_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(3);
}
static void cy_i2c_4_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(4);
}
static void cy_i2c_5_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(5);
}
static void cy_i2c_6_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(6);
}
static void cy_i2c_7_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(7);
}
static void cy_i2c_8_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(8);
}
static void cy_i2c_9_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(9);
}
static void cy_i2c_10_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(10);
}
static void cy_i2c_11_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(11);
}
static void cy_i2c_12_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(12);
}
static void cy_i2c_13_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(13);
}
static void cy_i2c_14_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(14);
}
static void cy_i2c_15_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(15);
}
static void cy_i2c_16_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(16);
}
static void cy_i2c_17_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(17);
}
static void cy_i2c_18_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(18);
}
static void cy_i2c_19_irq_handler(void)
{
    cy_i2c_interrupts_dispatcher_IRQHandler(19);
}
static void (*cy_i2c_interrupts_dispatcher_table[CY_IP_MXSCB_INSTANCES])(void) = 
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cy_i2c_0_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cy_i2c_1_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cy_i2c_2_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cy_i2c_3_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cy_i2c_4_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cy_i2c_5_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cy_i2c_6_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cy_i2c_7_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cy_i2c_8_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cy_i2c_9_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cy_i2c_10_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cy_i2c_11_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cy_i2c_12_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cy_i2c_13_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cy_i2c_14_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cy_i2c_15_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cy_i2c_16_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cy_i2c_17_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cy_i2c_18_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cy_i2c_19_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

