dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_i2c.c
static cy_rslt_t cy_free_resources(cy_i2c_t *obj)
{
    cy_rslt_t error_accum = CY_RSLT_SUCCESS;
    cy_rslt_t error;
    if (obj->resource.type != CY_RSC_INVALID)
    {
        error_accum = cy_hwmgr_free(&(obj->resource));
        obj->resource.type = CY_RSC_INVALID;
    }
    if (obj->pin_sda != NC)
    {
        error = cy_disconnect_pin(obj->pin_sda);
        if (error == CY_RSLT_SUCCESS)
        {
            cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_sda);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    if (obj->pin_scl != NC)
    {
        error = cy_disconnect_pin(obj->pin_scl);
        if (error == CY_RSLT_SUCCESS)
        {
            cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_sda);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }    
    return error_accum;
}

/* Start API implementing */

cy_rslt_t cy_i2c_init(cy_i2c_t *obj, cy_gpio_t sda, cy_gpio_t scl, const cy_clock_divider_t *clk)
{
	/* If something go wrong, any resource not marked as invalid will be freed. */
    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    memset(obj, 0, sizeof(cy_i2c_t));
	cy_resource_inst_t pin_rsc;

    
    /* Reserve the I2C */
    const cy_resource_pin_mapping_t *sda_map = CY_UTILS_GET_RESOURCE(sda, cy_pin_map_scb_i2c_sda);
    const cy_resource_pin_mapping_t *scl_map = CY_UTILS_GET_RESOURCE(scl, cy_pin_map_scb_i2c_scl);
    if (NULL == sda_map || NULL == scl_map || sda_map->inst->block_num != scl_map->inst->block_num)
    {
        return CY_RSLT_ERR_CSP_I2C_INVALID_PIN;
    }
    obj->resource = *scl_map->inst;
    
    /* Reserve the SDA pin */
    pin_rsc = cy_utils_get_gpio_resource(sda);
	cy_rslt_t result = cy_hwmgr_reserve(&pin_rsc);
    if (result == CY_RSLT_SUCCESS)
    {
        obj->pin_sda = sda;
    }
    
    /* Reseve the SCL pin */
    if (result == CY_RSLT_SUCCESS)
    {
		pin_rsc = cy_utils_get_gpio_resource(scl);
		cy_rslt_t result = cy_hwmgr_reserve(&pin_rsc);
		if (result == CY_RSLT_SUCCESS)
		{
			obj->pin_scl = scl;
		}
	}
    
    obj->base = CY_SCB_BASE_ADDRESSES[obj->resource.block_num];
    
    if (result == CY_RSLT_SUCCESS)
    {
        if (clk == NULL)
        {
            result = cy_hwmgr_allocate_clock(&(obj->clock), CY_SYSCLK_DIV_8_BIT, true);
        }
        else
        {
            obj->clock = *clk;
        }
         
    }
    if (result == CY_RSLT_SUCCESS)
    {
        cy_en_sysclk_status_t clock_assign_result = Cy_SysClk_PeriphAssignDivider(
            (en_clk_dst_t)((uint8_t)PCLK_SCB0_CLOCK + obj->resource.block_num), obj->clock.div_type, obj->clock.div_num);

        result = clock_assign_result == CY_SYSCLK_SUCCESS
            ? CY_RSLT_SUCCESS
            : CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_MODULE_I2C, CY_I2C_CLOCK_ERROR);
    }    
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_connect_pin(sda_map);
    }
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_connect_pin(scl_map);
    }

    bool configured = false;
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_hwmgr_is_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num, &configured);
    }
    
    if (result == CY_RSLT_SUCCESS && !configured)
    {
        Cy_SCB_I2C_Init(obj->base, &default_i2c_config, &(obj->context));                 
        cy_hwmgr_set_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    }
    if (result != CY_RSLT_SUCCESS)
    {
        cy_free_resources(obj);
    }
    return result;	
}

cy_rslt_t cy_i2c_free(cy_i2c_t *obj)
{
	cy_rslt_t error_accum = CY_RSLT_SUCCESS;
    cy_rslt_t error = cy_free_resources(obj);
    if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
    {
        error_accum = error;
    }
    error = cy_hwmgr_set_unconfigured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
    {
        error_accum = error;
    }
    error = cy_hwmgr_free_clock(&(obj->clock));
    if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
    {
        error_accum = error;
    }
    return error_accum;
}

cy_rslt_t cy_i2c_set_config(cy_i2c_t *obj, const cy_hal_i2c_cfg_t *cfg) 
{
	cy_stc_scb_i2c_config_t config_structure = default_i2c_config;    
    if (cfg->is_slave) {
        config_structure.i2cMode = CY_SCB_I2C_SLAVE;
    }
    else {
        config_structure.i2cMode = CY_SCB_I2C_MASTER;
    }
    config_structure.slaveAddress  = cfg->address;
	Cy_SCB_I2C_SetDataRate(obj->base, cfg->frequency_hz, Cy_SysClk_PeriphGetFrequency(CY_SYSCLK_DIV_8_BIT, 0UL));

    Cy_SCB_I2C_Init(obj->base, &config_structure, &(obj->context));
    cy_rslt_t result = cy_hwmgr_set_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);    
    return result;
}

cy_rslt_t cy_i2c_master_send(cy_i2c_t *obj, uint16_t dev_addr, const uint8_t *data, uint16_t size, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status = CY_SCB_I2C_SUCCESS;
    int byte_count = 0;
    dev_addr >>= 1;

    /* Start transaction, send dev_addr. */
    if (obj->context.state == CY_SCB_I2C_IDLE) {
        status = Cy_SCB_I2C_MasterSendStart(obj->base, dev_addr, CY_SCB_I2C_WRITE_XFER, timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        while (size > 0) {
            status = Cy_SCB_I2C_MasterWriteByte(obj->base, *data, timeout, &obj->context);
            if (status != CY_SCB_I2C_SUCCESS) {
                break;
            }
            ++byte_count;
            --size;
            ++data;
        }
        /* SCB in I2C mode is very time sensitive. In practice we have to request STOP after */
        /* each block, otherwise it may break the transmission */
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

    if (status != CY_SCB_I2C_SUCCESS) {
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

