dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_i2c.c
    return status;
}

cy_rslt_t cy_i2c_master_recv(cy_i2c_t *obj, uint16_t dev_addr, uint8_t *data, uint16_t size, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status = CY_SCB_I2C_SUCCESS;
    cy_en_scb_i2c_command_t ack = CY_SCB_I2C_ACK;
    int byte_count = 0;
    dev_addr >>= 1;

    /* Start transaction, send dev_addr */
    if (obj->context.state == CY_SCB_I2C_IDLE) {
        status = Cy_SCB_I2C_MasterSendStart(obj->base, dev_addr, CY_SCB_I2C_READ_XFER, timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        while (size > 0) {
            if (size == 1) {
                ack = CY_SCB_I2C_NAK;
            }
            status = Cy_SCB_I2C_MasterReadByte(obj->base, ack, (uint8_t *)data, timeout, &obj->context);
            if (status != CY_SCB_I2C_SUCCESS) {
                break;
            }
            ++byte_count;
            --size;
            ++data;
        }
        /* SCB in I2C mode is very time sensitive. In practice we have to request STOP after */
        /* each block, otherwise it may break the transmission */
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

    if (status != CY_SCB_I2C_SUCCESS) {
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

    return status;
}

cy_rslt_t cy_i2c_slave_send(cy_i2c_t *obj, const uint8_t *data, uint16_t size, uint32_t timeout)
{
	if (obj->context.state == CY_SCB_I2C_IDLE) {
        Cy_SCB_I2C_SlaveConfigReadBuf(obj->base, (uint8_t *)data, size, &obj->context);
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_i2c_slave_recv(cy_i2c_t *obj, uint8_t *data, uint16_t size, uint32_t timeout)
{
    if (obj->context.state == CY_SCB_I2C_IDLE) {	
        Cy_SCB_I2C_SlaveConfigWriteBuf(obj->base, (uint8_t *)data, size, &obj->context);
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_i2c_mem_write(cy_i2c_t *obj, uint16_t address, uint16_t mem_addr, uint16_t mem_addr_size, const uint8_t *data, uint16_t size, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status = CY_SCB_I2C_SUCCESS;
    int byte_count = 0;
    address >>= 1;

    /* Start transaction, send address. */
    if (obj->context.state == CY_SCB_I2C_IDLE) {
        status = Cy_SCB_I2C_MasterSendStart(obj->base, address, CY_SCB_I2C_WRITE_XFER, timeout, &obj->context);
    }
    /* Send mem_addr - start address in slave memory */
    if (status == CY_SCB_I2C_SUCCESS) {
        status = Cy_SCB_I2C_MasterWriteByte(obj->base, (uint8_t)((mem_addr & 0xFF00) >> 8), timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        status = Cy_SCB_I2C_MasterWriteByte(obj->base, (uint8_t)(mem_addr & 0x00FF), timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        while (size > 0) {
            status = Cy_SCB_I2C_MasterWriteByte(obj->base, *data, timeout, &obj->context);
            if (status != CY_SCB_I2C_SUCCESS) {
                break;
            }
            ++byte_count;
            --size;
            ++data;
        }
        /* SCB in I2C mode is very time sensitive. In practice we have to request STOP after */
        /* each block, otherwise it may break the transmission */
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }
    if (status != CY_SCB_I2C_SUCCESS) {
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }
    return status;    
}

cy_rslt_t cy_i2c_mem_read(cy_i2c_t *obj, uint16_t address, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t *data, uint16_t size, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status = CY_SCB_I2C_SUCCESS;
    cy_en_scb_i2c_command_t ack = CY_SCB_I2C_ACK;
    int byte_count = 0;
    address >>= 1;

    /* Start transaction, send address */
    if (obj->context.state == CY_SCB_I2C_IDLE) {
        status = Cy_SCB_I2C_MasterSendStart(obj->base, address, CY_SCB_I2C_READ_XFER, timeout, &obj->context);
    }
     /* Send mem_addr - start address in slave memory */
    if (status == CY_SCB_I2C_SUCCESS) {
        status = Cy_SCB_I2C_MasterWriteByte(obj->base, (uint8_t)((mem_addr & 0xFF00) >> 8), timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        status = Cy_SCB_I2C_MasterWriteByte(obj->base, (uint8_t)(mem_addr & 0x00FF), timeout, &obj->context);
    }
    if (status == CY_SCB_I2C_SUCCESS) {
        while (size > 0) {
            if (size == 1) {
                ack = CY_SCB_I2C_NAK;
            }
            status = Cy_SCB_I2C_MasterReadByte(obj->base, ack, (uint8_t *)data, timeout, &obj->context);
            if (status != CY_SCB_I2C_SUCCESS) {
                break;
            }
            ++byte_count;
            --size;
            ++data;
        }
        /* SCB in I2C mode is very time sensitive. In practice we have to request STOP after */
        /* each block, otherwise it may break the transmission */
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

    if (status != CY_SCB_I2C_SUCCESS) {
        Cy_SCB_I2C_MasterSendStop(obj->base, timeout, &obj->context);
    }

    return status;
}

cy_rslt_t cy_i2c_transfer_async(cy_i2c_t *obj, const void *tx, size_t tx_size, void *rx, size_t rx_size, uint16_t address)
{
	if (obj->pending != PENDING_NONE) {
        return 0; //TODO: return reason
    }

    obj->rx_config.slaveAddress = address >> 1;
    obj->tx_config.slaveAddress = address >> 1;
    // obj->events = event;
    // obj->handler = handler;
    // if (i2c_irq_setup_channel(obj) < 0) {
    //     return;
    // }

    obj->rx_config.buffer = rx;
    obj->rx_config.bufferSize = rx_size;
    //obj->rx_config.xferPending = !stop;

    obj->tx_config.buffer = (void *)tx;
    obj->tx_config.bufferSize = tx_size;
    // obj->tx_config.xferPending = rx_size || !stop;

    if (tx_size) {
        /* Write first, then read, or write only. */
        if (rx_size > 0) {
            obj->pending = PENDING_TX_RX;
        } else {
            obj->pending = PENDING_TX;
        }
        Cy_SCB_I2C_MasterWrite(obj->base, &obj->tx_config, &obj->context);
    } else if (rx_size) {
        /* Read transaction */
        obj->pending = PENDING_RX;
        Cy_SCB_I2C_MasterRead(obj->base, &obj->rx_config, &obj->context);
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_i2c_abort_async(cy_i2c_t *obj)
{
	if (obj->pending != PENDING_NONE) {
        if (obj->pending == PENDING_RX) {
            Cy_SCB_I2C_MasterAbortRead(obj->base, &obj->context);
        } else {
            Cy_SCB_I2C_MasterAbortWrite(obj->base, &obj->context);
        }
    }
    return CY_RSLT_SUCCESS;
}

static cy_i2c_irq_event_t cy_convert_interrupt_cause(uint32_t pdl_cause)
{    
    // TODO: Verify events
    cy_i2c_irq_event_t cause = CY_I2C_IRQ_NONE;
    if (pdl_cause == CY_I2C_IRQ_TX_TRANSMIT_IN_FIFO)
    {
        cause = CY_I2C_IRQ_TX_TRANSMIT_IN_FIFO;
    }
    else if (pdl_cause == CY_I2C_IRQ_NONE)
    {
        cause = CY_I2C_IRQ_NONE;
    }
    else if (pdl_cause == CY_I2C_IRQ_TX_DONE)
    {
        cause = CY_I2C_IRQ_TX_DONE;
    }
    else if (pdl_cause == CY_I2C_IRQ_TX_ERROR)
    {
        cause = CY_I2C_IRQ_TX_ERROR;
    }
    else if (pdl_cause == CY_I2C_IRQ_RX_FULL)
    {
        cause = CY_I2C_IRQ_RX_FULL;
    }
    else if (pdl_cause == CY_I2C_IRQ_RX_DONE)
    {
        cause = CY_I2C_IRQ_RX_DONE;
    }
    else if (pdl_cause == CY_I2C_IRQ_RX_ERROR)
    {
        cause = CY_I2C_IRQ_RX_ERROR;
    }
    return cause;
}

cy_rslt_t cy_i2c_register_irq(cy_i2c_t *obj, cy_i2c_irq_handler handler, void *handler_arg)
{
	uint8_t idx = obj->resource.block_num;
    cy_i2c_config_structs[idx] = obj;
    cy_i2c_user_callbacks[idx] = handler;
    cy_i2c_callback_args[idx] = handler_arg;
    Cy_SCB_I2C_RegisterEventCallback(obj->base, cy_i2c_cb_wrapper_table[idx], &(obj->context));
    if (NVIC_GetEnableIRQ(CY_SCB_IRQ_N[idx]) == 0)
    {
        /* Default interrupt priority of 7 (lowest possible priority). */
        cy_stc_sysint_t irqCfg = {CY_SCB_IRQ_N[idx], 7};

        Cy_SysInt_Init(&irqCfg, cy_i2c_interrupts_dispatcher_table[idx]);
        NVIC_EnableIRQ(CY_SCB_IRQ_N[idx]);
    }
    
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_i2c_irq_enable(cy_i2c_t *obj, cy_i2c_irq_event_t event, bool enable)
{
	if (enable)
    {
        obj->irq_cause |= event;
    }
    else
    {
        obj->irq_cause &= ~event;
    }
    return CY_RSLT_SUCCESS;
}

